papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/perpendicularFlap/base/quasiMonolithic/constant/fluid/fluidProperties.monolithic
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidModel    newtonIcoFluid;

newtonIcoFluidCoeffs
{
    forceImplicitFlux yes;

    fluidFluxExtrapolationAlgorithm1 yes;

    addDivPhiUDamping no;

    pressureScaleFactor 1.0;

    stabilisation
    {
        type RhieChow;
        scaleFactor 1.0;
    }
}

// ************************************************************************* //
