papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/perpendicularFlap/base/quasiMonolithic/0/fluid/D.monolithic
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    flap
    {
        type           fixedDisplacement;
        enforcePointPatchField no;
        value          uniform (0 0 0);
    }
    outlet
    {
        type           fixedDisplacement;
        value          uniform (0 0 0);
    }
    inlet
    {
        type           fixedDisplacement;
        value          uniform (0 0 0);
    }
    upperWall
    {
        type           fixedDisplacement;
        value          uniform (0 0 0);
    }
    lowerWall
    {
        type           fixedDisplacement;
        value          uniform (0 0 0);
    }
    frontAndBack
    {
        type           empty;
    }
}

// ************************************************************************* //
